--------------------------------------------------------------------------------------------- 
⋙ ❍ Разминка. Последовательные алгоритмы:
---
Эти задачи помогают укрепить навыки работы с простыми алгоритмами и основами программирования.
0️⃣ Сложение двух чисел
⌛ Задача: Напишите функцию, которая принимает два числа и возвращает их сумму.
🎯 Решение:
```js
function sum(a, b) {
  return a + b;
}

console.log(sum(3, 4)); // 7
```
Объяснение: Простая функция, которая складывает два числа и возвращает результат.
--------------------------------------------------------------------------------------------- 
