---------------------------------------------------------------------------------------------
⋙ ❍ Графы:
---
1️⃣ Обход в глубину (DFS)
⌛ Задача: Реализовать DFS для обхода графа.
🎯 Решение и объяснение:
DFS рекурсивно посещает вершины, углубляясь как можно дальше.
```js
const dfs = (graph, start, visited = new Set()) => {
  if (!visited.has(start)) {
    console.log(start);
    visited.add(start);
    for (let neighbor of graph[start]) {
      dfs(graph, neighbor, visited);
    }
  }
};

const graph2 = { 0: [1, 2], 1: [0, 3], 2: [0], 3: [1] };
dfs(graph2, 0);
// Вывод: 0 1 3 2
```
---------------------------------------------------------------------------------------------
