---------------------------------------------------------------------------------------------
⋙ ❍ Дек:
---
5️⃣ Циклический сдвиг массива
⌛ Задача: Сдвинуть массив вправо на `k` позиций.
🎯 Решение:
```js
const rotateArray = (arr, k) => {
  const deque = new Deque();
  for (let num of arr) deque.pushBack(num);

  for (let i = 0; i < k; i++) deque.pushFront(deque.popBack());

  return [...deque.items];
};

console.log(rotateArray([1, 2, 3, 4, 5], 2)); // [4, 5, 1, 2, 3]
```
---------------------------------------------------------------------------------------------
